app/views/assignments/_assignment.html.erb

<% if !@project.assignments.empty? %>
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."project_id" = ?  [["project_id", 1]]