app/views/assignments/index.html.erb

      <div class="d-flex align-items-center justify-content-between">
        <b> <%= assignment.task %> &rarr; <%= Project.find(assignment.project_id).title %> </b>
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]