app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def show
    @assignment = Assignment.find(params[:id])
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @project = Project.find(params[:project_id])
    @assignment = @project.assignments.create(assignment_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "assignments" ("task", "description", "epic", "due_date", "assgined_for", "assignee", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @project = Project.find(params[:project_id])
    @assignment = Assignment.find(params[:id]&.to_i)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @project = Project.find(params[:project_id])
    @assignment = @project.assignments.find(params[:id])
    if @assignment.update(assignment_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."project_id" = ? AND "assignments"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "assignments" SET "due_date" = ?, "status" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["due_date", "2023-01-12 00:00:00"], ["status", "In Progress"], ["updated_at", "2022-12-22 13:26:30.556879"], ["id", 3]]

  def destroy
    @project = Project.find(params[:project_id])
    @assignment = @project.assignments.find(params[:id])
    @assignment.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."project_id" = ? AND "assignments"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]