app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("title", "description", "status", "team_lead", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "description" = ?, "status" = ?, "updated_at" = ? WHERE "projects"."id" = ?